import { from } from "rxjs";
import { tap, filter, distinct } from "rxjs/operators";

const observer = {
  next: (...args) => {
    console.log("next : ", ...args);
  },
  error: (err) => {
    console.error("error : ", err);
  },
  complete: () => {
    console.log("complete");
  },
};

from([9, 3, 10, 5, 1, 10, 9, 9, 1, 4, 1, 8, 6, 2, 7, 2, 5, 5, 10, 2])
  .pipe(
    tap((x) => {
      console.log("-------------- 처음 탭: " + x);
    }),
    filter((x) => {
      return x % 2 === 0;
    }),
    tap((x) => {
      console.log("--------- 필터 후: " + x);
    }),
    distinct(),
    tap((x) => {
      console.log("중복 제거 후: " + x);
    })
  )
  .subscribe(observer);
/**

-------------- 처음 탭: 9
 -------------- 처음 탭: 3
 -------------- 처음 탭: 10
 --------- 필터 후: 10
 중복 제거 후: 10
 next :  10
 -------------- 처음 탭: 5
 -------------- 처음 탭: 1
 -------------- 처음 탭: 10
 --------- 필터 후: 10
 -------------- 처음 탭: 9
 -------------- 처음 탭: 9
 -------------- 처음 탭: 1
 -------------- 처음 탭: 4
 --------- 필터 후: 4
 중복 제거 후: 4
 next :  4
 -------------- 처음 탭: 1
 -------------- 처음 탭: 8
 --------- 필터 후: 8
 중복 제거 후: 8
 next :  8
 -------------- 처음 탭: 6
 --------- 필터 후: 6
 중복 제거 후: 6
 next :  6
 -------------- 처음 탭: 2
 --------- 필터 후: 2
 중복 제거 후: 2
 next :  2
 -------------- 처음 탭: 7
 -------------- 처음 탭: 2
 --------- 필터 후: 2
 -------------- 처음 탭: 5
 -------------- 처음 탭: 5
 -------------- 처음 탭: 10
 --------- 필터 후: 10
 -------------- 처음 탭: 2
 --------- 필터 후: 2
 complete
*/
